# Pandas dataframe.replace() function

Pandas dataframe.replace() function is used to replace a string,  list, dictionary, series, number etc. from a dataframe. This is a very rich function as it has many variations.

**Syntax:** DataFrame.replace(to_replace="value which is replaced", value="Value which is added")

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'Name': ['Faisal', 'Ali', 'Ahmed', 'Usman'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

     Name  Height Qualification
0  Faisal     5.1           Msc
1     Ali     6.2            MA
2   Ahmed     5.1           Msc
3   Usman     5.2           Msc

# Change single value with a single value

In [8]:
df.replace(to_replace=5.1,value=6.6,inplace = True)

In [9]:
df

     Name  Height Qualification
0  Faisal     6.6           Msc
1     Ali     6.2            MA
2   Ahmed     6.6           Msc
3   Usman     5.2           Msc

The value doesnot change in Memory but it change the data temporary if you want to change it permenently you can add an additional atribute "inplace" which the value is "True" (inplace = True). It change your orignal dataframe value

# Chnage multiple values with a single value

If you want to change multiple values with a single value you will need to pass List of values

In [19]:
df.replace(to_replace =["Msc", 6.6],  
                            value ="MBA",inplace = True) 
df

     Name Height Qualification
0  Faisal    MBA           MBA
1     Ali    6.2           MBA
2   Ahmed    MBA           MBA
3   Usman    5.2           MBA